# 4. * Функция принимает в качестве аргументов строки в формате «Имя Фамилия»,
#      возвращает словарь, ключи — первые буквы фамилий, значения — словари,
#      реализованные по схеме предыдущего задания.
# in      "Иван Сергеев", "Инна Серова", "Петр Алексеев",
#         "Илья Иванов", "Анна Савельева", "Юнона Ветрякова",
#         "Борис Аркадьев", "Антон Серов", "Павел Анисимов"
# out     {'С': {'А': ['Анна Савельева', 'Антон Серов'], 'И': ['Иван Сергеев', 'Инна Серова']},
#          'А': {'Б': ['Борис Аркадьев'], 'П': ['Павел Анисимов', 'Петр Алексеев']},
#          'И': {'И': ['Илья Иванов']}, 'В': {'Ю': ['Юнона Ветрякова']}}

invoice_list = ('Иван Сергеев', 'Инна Серова', 'Петр Алексеев', 'Илья Иванов', 'Анна Савельева',
                'Юнона Ветрякова', 'Борис Аркадьев', 'Антон Серов', 'Павел Анисимов')
# invoice_list = ('Иван Сергеев', 'Инна Серова', 'Петр Алексеев', 'Борис Аркадьев')


def split_to_dict_by_name(li: list):
    res = {}
    for i in li:
        if i[0] not in res:
            res[i[0]] = []
        res[i[0]].append(i)
    return res


def split_by_surname_and_name(li: list):
    res = {}
    for i in li:
        j = i.split()
        if j[1][0] not in res:
            res[j[1][0]] = []
        res[j[1][0]].append(i)
    for i in res:
        res[i] = split_to_dict_by_name(res[i])
    return res


print(invoice_list)
out_surname_dict = split_by_surname_and_name(list(invoice_list))
print(out_surname_dict)
