# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

stri='gipopotampo'
# n = input('Введите длинную строку: ')
# m = input('Введите короткую строку: ')
# print(n.count(m))
print(stri.count('po'))